Autodesk.Revit.UI.Selection.PickBoxStyle
The enum that controls the style of the pick box.

Autodesk.Revit.UI.Selection.PickBoxStyle.Directional
The style of the box depends on the direction in which the box is being drawn. It uses the Crossing style if it is being drawn from right to left, or the Enclosing style when drawn in the opposite direction.

Autodesk.Revit.UI.Selection.PickBoxStyle.Enclosing
Draws the box with the style that is used when selecting objects that are completely enclosed by the box.

Autodesk.Revit.UI.Selection.PickBoxStyle.Crossing
Draws the box with the style that is used when selecting objects completely or partially inside the box.